#### In this file production, consumption and other related features for renewable energy for united states will be created.

In [1]:
#importing dependencies
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
#importing data from excel into dataframe
us_energy_df = pd.read_excel("Resources/Total_Renewable_energy.xlsx")
us_energy_df.head()

,Data_Status,StateCode,MSN,1960,1961,1962,1963,1964,1965,1966,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,2020F,AK,BDFDB,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,21.0,27.0,29.0,15.0,0.0,0.0
1,2020F,AK,BDPRP,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,4.0,5.0,5.0,3.0,0.0,0.0
2,2020F,AK,BFFDB,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,21.0,27.0,29.0,15.0,0.0,0.0
3,2020F,AK,BFPRP,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,4.0,5.0,5.0,3.0,0.0,0.0
4,2020F,AK,CLPRB,11263.0,11497.0,13588.0,13307.0,11622.0,13931.0,14461.0,...,33524.0,31332.0,24917.0,22944.0,17747.0,13942.0,14365.0,13752.0,14867.0,15523.0

In [3]:
#filter the data with StateCode 'US' and MSN code 'REPRB' for renewable energy
us_only_df = us_energy_df.loc[(us_energy_df["StateCode"] =="US") & 
                              (us_energy_df["MSN"] =="REPRB")]
us_only_df.head()

,Data_Status,StateCode,MSN,1960,1961,1962,1963,1964,1965,1966,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
1295,2020F,US,REPRB,2928205.0,2952227.0,3117444.0,3096431.0,3225249.0,3395816.0,3432463.0,...,9301571.0,8889306.0,9422721.0,9775755.0,9743161.0,10445341.0,11225892.0,11540403.0,11563117.0,11613541.0

In [4]:
#remove columns that won't be used
us_production_df = us_only_df.drop(["Data_Status", "StateCode", "MSN"], axis = 1)
us_production_df.head()

,1960,1961,1962,1963,1964,1965,1966,1967,1968,1969,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
1295,2928205.0,2952227.0,3117444.0,3096431.0,3225249.0,3395816.0,3432463.0,3690213.0,3772655.0,4094893.0,...,9301571.0,8889306.0,9422721.0,9775755.0,9743161.0,10445341.0,11225892.0,11540403.0,11563117.0,11613541.0

In [5]:
#convert rows into columns
us_df_pr = us_production_df.melt(var_name = "Year", value_name = "Renewable energy production in billion (BTU)")
us_df_pr.head()

   Year  Renewable energy production in billion (BTU)
0  1960                                     2928205.0
1  1961                                     2952227.0
2  1962                                     3117444.0
3  1963                                     3096431.0
4  1964                                     3225249.0

In [6]:
us_df_pr.shape

(61, 2)

## extracting consumption data

In [7]:
##filter the data with StateCode 'US' and MSN code 'TETCB' for renewable energy
us_consumption_df = us_energy_df.loc[(us_energy_df["StateCode"] =="US") & 
                              (us_energy_df["MSN"] =="TETCB")]
us_consumption_df.head()

,Data_Status,StateCode,MSN,1960,1961,1962,1963,1964,1965,1966,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
1298,2020F,US,TETCB,45033606.0,45684153.0,47773067.0,49605630.0,51766732.0,53965864.0,56960904.0,...,96868658.0,94366760.0,97106124.0,98279417.0,97378350.0,97351106.0,97628486.0,101193066.0,100357531.0,92862342.0

In [8]:
#remove columns that won't be used
us_con_df = us_consumption_df.drop(["Data_Status", "StateCode", "MSN"], axis = 1)
us_con_df.head()

,1960,1961,1962,1963,1964,1965,1966,1967,1968,1969,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
1298,45033606.0,45684153.0,47773067.0,49605630.0,51766732.0,53965864.0,56960904.0,58916870.0,62401694.0,65578920.0,...,96868658.0,94366760.0,97106124.0,98279417.0,97378350.0,97351106.0,97628486.0,101193066.0,100357531.0,92862342.0

In [9]:
#convert rows into columns
us_dfc = us_con_df.melt(var_name = "Year", value_name = "Total energy consumption in billion (BTU)")
us_dfc.head()

   Year  Total energy consumption in billion (BTU)
0  1960                                 45033606.0
1  1961                                 45684153.0
2  1962                                 47773067.0
3  1963                                 49605630.0
4  1964                                 51766732.0

In [10]:
us_dfc.shape

(61, 2)

### Extracting population and GDP

In [11]:
#importing data from excel into dataframe

xls = pd.ExcelFile('Resources/Total_Population.xlsx')
population_df = pd.read_excel(xls, 'Total Population')
gdp_df = pd.read_excel(xls, 'Real GDP')

In [12]:
population_df.head()

,"Resident population including Armed Forces, thousand",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 52,Unnamed: 53,Unnamed: 54,Unnamed: 55,Unnamed: 56,Unnamed: 57,Unnamed: 58,Unnamed: 59,Unnamed: 60,Unnamed: 61
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,State,1960.0,1961.0,1962.0,1963.0,1964.0,1965.0,1966.0,1967.0,1968.0,...,2011.0,2012.0,2013.0,2014.0,2015.0,2016.0,2017.0,2018.0,2019.0,2020.0
2,AK,229.0,238.0,246.0,256.0,263.0,271.0,271.0,278.0,285.0,...,722.0,731.0,738.0,737.0,738.0,743.0,741.0,737.0,734.0,732.0
3,AL,3274.0,3316.0,3323.0,3358.0,3395.0,3443.0,3464.0,3458.0,3446.0,...,4800.0,4817.0,4832.0,4844.0,4855.0,4867.0,4878.0,4892.0,4908.0,5025.0
4,AR,1789.0,1806.0,1853.0,1875.0,1897.0,1894.0,1899.0,1901.0,1902.0,...,2941.0,2953.0,2960.0,2969.0,2980.0,2992.0,3004.0,3012.0,3021.0,3012.0

In [13]:
#setting years as header for pupulation data 
new_header = population_df.iloc[1]
population_df1 = population_df[2:]
population_df1.columns = new_header
population_df1.head()

1,State,1960.0,1961.0,1962.0,1963.0,1964.0,1965.0,1966.0,1967.0,1968.0,...,2011.0,2012.0,2013.0,2014.0,2015.0,2016.0,2017.0,2018.0,2019.0,2020.0
2,AK,229.0,238.0,246.0,256.0,263.0,271.0,271.0,278.0,285.0,...,722.0,731.0,738.0,737.0,738.0,743.0,741.0,737.0,734.0,732.0
3,AL,3274.0,3316.0,3323.0,3358.0,3395.0,3443.0,3464.0,3458.0,3446.0,...,4800.0,4817.0,4832.0,4844.0,4855.0,4867.0,4878.0,4892.0,4908.0,5025.0
4,AR,1789.0,1806.0,1853.0,1875.0,1897.0,1894.0,1899.0,1901.0,1902.0,...,2941.0,2953.0,2960.0,2969.0,2980.0,2992.0,3004.0,3012.0,3021.0,3012.0
5,AZ,1321.0,1407.0,1471.0,1521.0,1556.0,1584.0,1614.0,1646.0,1682.0,...,6473.0,6556.0,6635.0,6733.0,6833.0,6945.0,7048.0,7164.0,7292.0,7178.0
6,CA,15870.0,16497.0,17072.0,17668.0,18151.0,18585.0,18858.0,19176.0,19394.0,...,37636.0,37945.0,38254.0,38587.0,38904.0,39149.0,39338.0,39437.0,39438.0,39500.0

In [14]:
##filter data for us pupulation
us_population_df = population_df1.loc[(population_df1["State"] =="US")]
us_population_df = us_population_df.drop("State",axis = 1)
us_population_df.head()

1,1960.0,1961.0,1962.0,1963.0,1964.0,1965.0,1966.0,1967.0,1968.0,1969.0,...,2011.0,2012.0,2013.0,2014.0,2015.0,2016.0,2017.0,2018.0,2019.0,2020.0
53,180671.0,183691.0,186538.0,189242.0,191889.0,194303.0,196560.0,198712.0,200706.0,202677.0,...,311583.0,313878.0,316060.0,318386.0,320739.0,323072.0,325122.0,326838.0,328330.0,331501.0

In [15]:
#convert rows into column
us_dfp = us_population_df.melt(var_name = "Year", value_name = "Total Population in Thousands")
us_dfp.head()

     Year  Total Population in Thousands
0  1960.0                       180671.0
1  1961.0                       183691.0
2  1962.0                       186538.0
3  1963.0                       189242.0
4  1964.0                       191889.0

In [16]:
#Creating GDP data
gdp_df.head()

,"Real Gross Domestic Product (GDP), million chained (2012) dollars",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,State,1997.0,1998.0,1999.0,2000.0,2001.0,2002.0,2003.0,2004.0,2005.0,...,2011.0,2012.0,2013.0,2014.0,2015.0,2016.0,2017.0,2018.0,2019.0,2020.0
2,AK,42211.0,41096.0,40591.0,39407.0,40959.0,42979.0,42355.0,44055.0,45657.0,...,55280.0,58284.0,55354.0,54188.0,54741.0,54247.0,54130.0,53250.0,53337.0,50161.0
3,AL,144501.0,149568.0,154900.0,157221.0,156853.0,160422.0,165135.0,176625.0,184370.0,...,187606.0,189246.0,191370.0,189886.0,191335.0,194284.0,197567.0,200801.0,203384.0,196906.0
4,AR,82571.0,84571.0,89115.0,89872.0,89789.0,92951.0,96945.0,101734.0,105980.0,...,107933.0,108492.0,110752.0,111735.0,112351.0,112798.0,113885.0,115938.0,116791.0,114944.0

In [17]:
#setting years as header for GDP data 
new_header1 = gdp_df.iloc[1]
gdp_df1 = gdp_df[2:]
gdp_df1.columns = new_header1
gdp_df1.head()

1,State,1997.0,1998.0,1999.0,2000.0,2001.0,2002.0,2003.0,2004.0,2005.0,...,2011.0,2012.0,2013.0,2014.0,2015.0,2016.0,2017.0,2018.0,2019.0,2020.0
2,AK,42211.0,41096.0,40591.0,39407.0,40959.0,42979.0,42355.0,44055.0,45657.0,...,55280.0,58284.0,55354.0,54188.0,54741.0,54247.0,54130.0,53250.0,53337.0,50161.0
3,AL,144501.0,149568.0,154900.0,157221.0,156853.0,160422.0,165135.0,176625.0,184370.0,...,187606.0,189246.0,191370.0,189886.0,191335.0,194284.0,197567.0,200801.0,203384.0,196906.0
4,AR,82571.0,84571.0,89115.0,89872.0,89789.0,92951.0,96945.0,101734.0,105980.0,...,107933.0,108492.0,110752.0,111735.0,112351.0,112798.0,113885.0,115938.0,116791.0,114944.0
5,AZ,168409.0,183061.0,198700.0,208440.0,213166.0,220697.0,234066.0,244317.0,262326.0,...,266102.0,271440.0,273482.0,276949.0,282577.0,291275.0,302455.0,313619.0,323894.0,320551.0
6,CA,1378277.0,1468731.0,1574306.0,1696172.0,1692324.0,1722522.0,1789999.0,1850905.0,1926842.0,...,2063828.0,2113096.0,2179229.0,2256055.0,2357453.0,2427895.0,2541769.0,2643576.0,2739343.0,2663666.0

In [18]:
##filter data for us gdp
us_gdp_df = gdp_df1.loc[(gdp_df1["State"] =="US")]
us_gdp_df = us_gdp_df.drop("State",axis = 1)
us_gdp_df.head()

1,1997.0,1998.0,1999.0,2000.0,2001.0,2002.0,2003.0,2004.0,2005.0,2006.0,...,2011.0,2012.0,2013.0,2014.0,2015.0,2016.0,2017.0,2018.0,2019.0,2020.0
53,11529157.0,12045824.0,12623361.0,13138035.0,13263417.0,13488357.0,13865519.0,14399696.0,14901269.0,15315943.0,...,15891534.0,16253970.0,16553348.0,16932051.0,17390295.0,17680274.0,18079084.0,18606787.0,19032672.0,18384687.0

In [19]:
#convert rows into column
us_dfg = us_gdp_df.melt(var_name = "Year", value_name = " US GDP in Million")
us_dfg.head()

     Year   US GDP in Million
0  1997.0          11529157.0
1  1998.0          12045824.0
2  1999.0          12623361.0
3  2000.0          13138035.0
4  2001.0          13263417.0

### Merging Population, production and consumption dataframes

In [20]:
us_df_merged1 = pd.merge(us_df_pr, us_dfc, on="Year")
us_df_merged = pd.merge(us_df_merged1, us_dfp, on = "Year")
us_df_merged.head()

,Year,Renewable energy production in billion (BTU),Total energy consumption in billion (BTU),Total Population in Thousands
0,1960,2928205.0,45033606.0,180671.0
1,1961,2952227.0,45684153.0,183691.0
2,1962,3117444.0,47773067.0,186538.0
3,1963,3096431.0,49605630.0,189242.0
4,1964,3225249.0,51766732.0,191889.0

In [21]:
us_df_merged.dtypes

Year                                             object
Renewable energy production in billion (BTU)    float64
Total energy consumption in billion (BTU)       float64
Total Population in Thousands                   float64
dtype: object

In [22]:
# convert year from string to integer
us_df_merged["Year"] = us_df_merged["Year"].astype(str).astype(int)

In [23]:
us_df_merged.dtypes

Year                                              int32
Renewable energy production in billion (BTU)    float64
Total energy consumption in billion (BTU)       float64
Total Population in Thousands                   float64
dtype: object